-- Створіть таблицю “pizza” (“id”, “name”, “price”, “diameter”). Валюту не враховуємо!
CREATE TABLE pizzas(
    id SERIAL PRIMARY KEY,
    name VARCHAR(64) NOT NULL CHECK(name != ''),
    price NUMERIC(8,2) NOT NULL CHECK(price > 0),
    diameter NUMERIC(3) NOT NULL CHECK(diameter >= 18 AND diameter <= 38)
);

-- Завдання на INSERT
-- Додати нову піцу Маргарита, діаметр 18, ціна 50,4грн.
INSERT INTO pizzas(name, diameter, price)
VALUES ("Маргарита", 18, 54.4)

-- Додати нову піцу Карбонара, діаметр 28, ціна 81грн.
INSERT INTO pizzas(name, diameter, price)
VALUES ("Карбонара", 28, 81);
-- Додайте дві нові піци одним запитом: Цезар, діаметр 38, ціна 149грн, Пепероні, діаметр 32, ціна 116грн
INSERT INTO pizzas(name, diameter, price)
VALUES ("Цезар", 38, 149), ("Пепероні", 32, 116);

-- Завдання на UPDATE
-- Поставте ціну Маргаріті 53грн.
-- Піца з id=4 поставте діаметр 30, поверніть усі оновлені данні.
-- Усім піцам, чия ціна більша за 100грн зробіть її 130грн, поверніть усі оновлені данні.
-- Піц з id більше 2 і менше 5 включно поставте діаметр 22.
-- Змініть Цезар на 4 сири та поставте ціну 180.

-- Завдання на SELECT
-- Вибрати піцу з id=3.
-- Вибрати піцу із ціною менше 100грн.
-- Вибрати піцу з ціною не рівною 130грн.
-- Дізнайтесь ціну і діаметр Пепероні.
-- Вибрати піцу під назвою Маргарита.
-- Вибрати всі піци, крім тієї, яка називається Карбонара.
-- Вибрати всі піци діаметром 22 та ціною менше 150грн.
-- Вибрати піцу з діаметром від 25 до 33 включно.
-- Вибрати піци з діаметром від 25 до 33 або з ціною від 100 до 200 грн.
-- Вибрати всі піци діаметром 22 або 180грн.

-- Завдання на DELETE
-- Видаліть піцу з id=3.
-- Видаліть Пепероні, поверніть усі видалені данні.
-- Видаліть всі піци, які мають діаметр 18, поверніть усі видалені данні.